app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $title = "Daftar Artikel";
        $model = new ArtikelModel();
        $artikel = $model->findAll();

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title'   => $title,
            'q'       => $q,
            'artikel' =>  $model->like('judul',  $q)->paginate(10),

SELECT *
FROM `artikel`
WHERE `id` = '1'
 LIMIT 1
---
 public function edit($id)
{
    $artikel = new ArtikelModel();
    // validasi data.
    $validation = \Config\Services::validation();
    $validation->setRules(["judul" => "required"]);
    $isDataValid = $validation->withRequest($this->request)->run();

    if ($isDataValid) {
        $file = $this->request->getFile('gambar');

        $data = [
            "judul" => $this->request->getPost("judul"),
            "isi" => $this->request->getPost("isi"),
        ];

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $file->move(ROOTPATH . 'public/gambar');
            $data['gambar'] = $file->getName();
        }

        $artikel->update($id, $data);
        return redirect("admin/artikel");
    }
    // ambil data lama
    $data = $artikel->where("id", $id)->first();

DELETE FROM `artikel`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        $artikel = new ArtikelModel();
        $artikel->delete($id);